raibisch/ESP32_DYNECALC/lib_save_ok/LuxWebsocket/src/LuxWebsocket.h
#ifndef LUX_WEBSOCKET_H
#define LUX_WEBSOCKET_H

#include <Arduino.h>

#include <WebSocketsClient.h>          // local lib without SSL based on https://github.com/Links2004/arduinoWebSockets
#include "ESP32ntp.h"
#include "XPString.h"



#ifdef DEBUG_PRINT
#define debug_begin(...) Serial.begin(__VA_ARGS__);
#define debug_print(...) Serial.print(__VA_ARGS__);
#define debug_write(...) Serial.write(__VA_ARGS__);
#define debug_println(...) Serial.println(__VA_ARGS__);
#define debug_printf(...) Serial.printf(__VA_ARGS__);
#define debug_printluxval(...) Serial.printf("[LUX] %s:\t %s\r\n",__VA_ARGS__, __VA_ARGS__);
#else
#define debug_begin(...)
#define debug_print(...)
#define debug_printf(...)
#define debug_write(...)
#define debug_println(...)
#define debug_printluxval(...)
#endif


// ----------- LUXTRONIK 2.1 Websocket communication ----------------------------
// ===============================================================================
/*  ----only for Test without Luxtronic ------
const char test_login_xml[] PROGMEM = ^
R"=====(
<Content>
 <item id='0x910164'><name>Temperaturen</name>
  <item id='0x98992c'><name>Vorlauf</name><value>20.2°C</value></item>
  <item id='0x9cfb4c'><name>Rücklauf</name><value>19.9°C</value></item>
  <item id='0x9cfb94'><name>Rückl.-Soll</name><value>15.0°C</value></item>
  <item id='0x9898e4'><name>Heissgas</name><value>28.2°C</value></item>
  <item id='0x9cfc24'><name>Außentemperatur</name><value>19.4°C</value></item>
  <item id='0x9cfc6c'><name>Mitteltemperatur</name><value>18.4°C</value></item>
  <item id='0x9cfcb4'><name>Warmwasser-Ist</name><value>38.6°C</value></item>
  <item id='0x98b1cc'><name>Warmwasser-Soll</name><value>40.0°C</value></item>
  <item id='0x98989c'><name>Wärmequelle-Ein</name><value>21.1°C</value></item>
  <item id='0x9cfabc'><name>Vorlauf max.</name><value>70.0°C</value></item>
  <item id='0x9e807c'><name>Ansaug VD</name><value>28.5°C</value></item>
  <item id='0x9e810c'><name>VD-Heizung</name><value>41.6°C</value></item>
  <item id='0x98978c'><name>Überhitzung</name><value>8.6 K</value></item>
  <item id='0x9897c4'><name>Überhitzung Soll</name><value>20.0 K</value></item>
  <item id='0x9e78e4'><name>TFL1</name><value>22.7°C</value></item>
  <item id='0x9e792c'><name>TFL2</name><value>24.6°C</value></item>
  <name>Temperaturen</name></item>

)=====";  


// Python example
//https://gist.github.com/BenPru/ec463ea835fb705b070939c793196f2e

/*
send: -->
LOGIN;

receive:<--
<Navigation id='0x9c7dd0'>
<item id='0x9c91e0'><name>Informationen</name>
  <item id='0x98abe0'><name>Temperaturen</name></item>
  <item id='0x98a1c0'><name>Eingänge</name></item>
  <item id='0x910040'><name>Ausgänge</name></item>
  <item id='0x98a178'><name>Ablaufzeiten</name></item>
  <item id='0x9100d0'><name>Betriebsstunden</name></item>
  <item id='0x9101f0'><name>Fehlerspeicher</name></item>
  <item id='0x9cf950'><name>Abschaltungen</name></item>
  <item id='0x9cf998'><name>Anlagenstatus</name></item>
  <item id='0x98a298'><name>Energiemonitor</name>
   <item id='0x9101a8'><name>Wärmemenge</name></item>
   <item id='0x910118'><name>Eingesetzte Energie</name></item>
  </item>
  <item id='0x910008'><name>GLT</name></item>
 </item>
 </Navigation>


send: -->
GET;0x9c91e0


                                                                                 x = values read
                                                                                 xx new values read
receive: <--
<Content>
 <item id='0x910164'><name>Temperaturen</name>
  <item id='0x98992c'><name>Vorlauf</name><value>20.2°C</value></item>           x
  <item id='0x9cfb4c'><name>Rücklauf</name><value>19.9°C</value></item>          x
  <item id='0x9cfb94'><name>Rückl.-Soll</name><value>15.0°C</value></item>
  <item id='0x9898e4'><name>Heissgas</name><value>28.2°C</value></item>          xx
  <item id='0x9cfc24'><name>Außentemperatur</name><value>19.4°C</value></item>   x
  <item id='0x9cfc6c'><name>Mitteltemperatur</name><value>18.4°C</value></item>  x
  <item id='0x9cfcb4'><name>Warmwasser-Ist</name><value>38.6°C</value></item>
  <item id='0x98b1cc'><name>Warmwasser-Soll</name><value>40.0°C</value></item>   x
  <item id='0x98989c'><name>Wärmequelle-Ein</name><value>21.1°C</value></item>   xx
  <item id='0x9cfabc'><name>Vorlauf max.</name><value>70.0°C</value></item>
  <item id='0x9e807c'><name>Ansaug VD</name><value>28.5°C</value></item>
  <item id='0x9e810c'><name>VD-Heizung</name><value>41.6°C</value></item>        xx
  <item id='0x98978c'><name>Überhitzung</name><value>8.6 K</value></item>        xx
  <item id='0x9897c4'><name>Überhitzung Soll</name><value>20.0 K</value></item>
  <item id='0x9e78e4'><name>TFL1</name><value>22.7°C</value></item>
  <item id='0x9e792c'><name>TFL2</name><value>24.6°C</value></item>
 <name>Temperaturen</name></item>

 <item id='0x9ce384'><name>Eingänge</name>
  <item id='0x9ade2c'><name>ASD</name><value>Aus</value></item>
  <item id='0x9adfc4'><name>EVU</name><value>Ein</value></item>
  <item id='0x9add54'><name>HD</name><value>Aus</value></item>
  <item id='0x9ae00c'><name>MOT</name><value>Ein</value></item>
  <item id='0x9add9c'><name>HD</name><value>7.24 bar</value></item>
  <item id='0x9adde4'><name>ND</name><value>7.23 bar</value></item>
  <item id='0x9ae1bc'><name>Durchfluss</name><value>--- l/h</value></item>      xx
  <item id='0x9ae30c'><name>EVU 2</name><value>Aus</value></item>
  <item id='0x9ae354'><name>STB E-Stab</name><value>Aus</value></item>
 <name>Eingänge</name></item>

 <item id='0x98a0ec'><name>Ausgänge</name>
  <item id='0x9ad3b4'><name>AV-Abtauventil</name><value>Aus</value></item>
  <item id='0x9ad5ac'><name>BUP</name><value>Aus</value></item>                xx  Umschalt-Heiz/WW
  <item id='0x9ad63c'><name>HUP</name><value>Aus</value></item>              
  <item id='0x9ad564'><name>Ventil.-BOSUP</name><value>Aus</value></item>
  <item id='0x9ad3fc'><name>Verdichter 1</name><value>Aus</value></item>
  <item id='0x9ad7a4'><name>ZIP</name><value>Aus</value></item>
  <item id='0x9ad8c4'><name>ZUP</name><value>Aus</value></item>
  <item id='0x9ad444'><name>ZWE 1</name><value>Aus</value></item>
  <item id='0x9ad48c'><name>ZWE 2 - SST</name><value>Aus</value></item>
  <item id='0x9aefac'><name>AO 1</name><value>10.00 V</value></item>
  <item id='0x9aefe4'><name>AO 2</name><value>10.00 V</value></item>
  <item id='0x9ad51c'><name>VD-Heizung</name><value>Ein</value></item>         xx
  <item id='0x9af594'><name>HUP</name><value>0.0 %</value></item>              xx
  <item id='0x9af65c'><name>Freq. Sollwert</name><value>0 RPM</value></item> 
  <item id='0x9af6f4'><name>Freq. aktuell</name><value>0 RPM</value></item>    xx
  <item id='0x9af89c'><name>Ventilatordrehzahl</name><value>0 RPM</value></item>
  <item id='0x9af8e4'><name>EEV Heizen</name><value>0.0 %</value></item>
  <item id='0x9af92c'><name>EEV Kühlen</name><value>0.0 %</value></item>
 <name>Ausgänge</name></item>

