raibisch/ESP32_DYNECALC/lib_save_ok/LuxWebsocket/src/LuxWebsocket.h
/// LUXTRONIK DATA ***************************************
#define LUX_XMLDEF_GRAD_C       "°C"
#define LUX_XML_DEF_KWH         " kWh"

//----------------------------------------------
#define LUX_XMLDEF_INFO         "Informationen"
//----------------------------------------------

#define LUX_XMLDEF_TEMPERATURE  "Temperaturen"
//----------------------------------------------
#define LUX_XMLDEF_TEMP_VL_IST  "Vorlauf</name><value>"
#define LUX_XMLDEF_TEMP_RL_IST  "cklauf</name><value>"
#define LUX_XMLDEF_TEMP_RL_SOLL "ckl.-Soll</name><value>"    // 10/2024
#define LUX_XMLDEF_TEMP_WW_IST  "Warmwasser-Ist</name><value>"
#define LUX_XMLDEF_TEMP_OUT     "Außentemperatur</name><value>"
#define LUX_XMLDEF_TEMP_HEGAS   "Heissgas</name><value>"
#define LUX_XMLDEF_TEMP_OUTM    "Mitteltemperatur</name><value>"
#define LUX_XMLDEF_TEMP_VDHEI   "VD-Heizung</name><value>"
#define LUX_XMLDEF_TEMP_WQ_IN   "rmequelle-Ein</name><value>"
#define LUX_XMLDEF_TEMP_VD_IN   "Ansaug VD</name><value>"

#define LUX_XMLDEF_ENERGY_OUT   "rmemenge"
//--------------------------------------------------
#ifdef Luxtronik_V3_89
#define LUX_XMLDEF_ENERGY_IN    "Eingesetzte Energie"
#else // >= V 3.90
#define LUX_XMLDEF_ENERGY_IN    "Leistungsaufnahme"
#endif
//-------------------------------------------------

// Eingänge ---------------------------------------
#define LUX_XML_DEF_FLOW        "Durchfluss</name><value>"

// Ausgänge ----------------------------------------

// Anlagenstatus -----------------------------------
#define LUX_XML_DEF_POWER_OUT "Heizleistung Ist</name><value>"
#ifndef Luxtronik_V3_89
#define LUX_XML_DEF_POWER_IN  "Leistungsaufnahme</name><value>"
#endif
#define LUX_XML_DEF_DEFROST_PERCENT "Abtaubedarf</name><value>"
#define LUX_XML_DEF_KWH_SUMIN   "Gesamt"


enum LUX_VAL_TYPE
{
  LUX_TEMP_VL_IST= 1,
  LUX_TEMP_RL_IST,
  LUX_TEMP_RL_SOLL,
  LUX_TEMP_WW_IST,
  LUX_TEMP_AT_IST,
  LUX_TEMP_AT_MID,
  LUX_TEMP_VDGAS, 
  LUX_TEMP_VDHEAT,
  LUX_TEMP_WQ_IN,
  LUX_TEMP_VD_IN,

  LUX_ENERGY_INSUM    = 20,
  LUX_ENERGY_IN_WW,
  LUX_ENERGY_IN_HEAT,
  LUX_ENERGY_OUTSUM,
  LUX_ENERGY_OUT_WW,
  LUX_ENERGY_OUT_HEAT,


  LUX_PUMP_FLOW      = 30,
  LUX_PUMP_PWM,
  LUX_PUMP_WW_SWITCH,

  LUX_POWER_OUT      = 40,
  LUX_POWER_IN,
  LUX_DEFROST_PERCENT,
  LUX_DEFROST_LASTTIME,
  LUX_VD_HEIZ,
  LUX_VD_RPM,
  LUX_VD_EEV,
  LUX_VD_ND,
  LUX_VD_HD,


  LUX_EVU_1          = 50,
  LUX_EVU_2,

  // intern calculated values:
  LUX_COP_SUM        = 60,
  LUX_COP_SUM_ELECT,
  LUX_COP_WW,
  LUX_COP_HEAT,

  LUX_COP_DAY_SUM,
  LUX_COP_DAY_HEAT,
  LUX_COP_DAY_WW,
  LUX_COP_ACTUAL,


  LUX_STATUS_POLL       = 70,
  LUX_STATUS_HEATPUMP
};


enum WS_POLL_STATUS
{
  NOT_CONNECTED = 0,  
  CLOSE_CONNECTION, 
  TIMEOUT,
  OPEN_CONNECTION,

  IS_CONNECTED = 10,
  SEND_LOGIN,
  SEND_GET_INFO,
  SEND_REFRESH,  
 
  NO_POLLING  = 20  
};

enum LUX_HEATPUMP_STATUS {
  INAKTIVE = 0,  
  HEATING,
  WW,
  DEFROST
};

class LuxWebsocket
{
  private: 
  static WStype_t wstype;
  static LUX_HEATPUMP_STATUS hp_state;

  LUX_VAL_TYPE valtype;

  uint32_t energyElektIn;
  uint32_t energySumIn;
  uint32_t energyWWIn;
  uint32_t energyHEIn;

  uint32_t energySumOut;
  uint32_t energyWWOut;
  uint32_t energyHEOut;

  uint32_t energyOldElectIn =0;
  uint32_t energyOldSumIn   =0;
  uint32_t energyOldWWIn    =0;
  uint32_t energyOldHEIn    =0;
  
  uint32_t energyOldSumOut=0;
  uint32_t energyOldWWOut =0;
  uint32_t energyOldHEOut =0;

  float COPdaySumElect =0;
  float COPdaySumLux =0;
  float COPdayWW =0;
  float COPdayHE =0;

 
  static void DataParser();
  bool wsConnect();
  static void wsEvent(WStype_t type, uint8_t * payload, size_t length);
   
  protected:
     String _sURL;
     String _sUser;
     String _sPassword;
     WebSocketsClient _wsClient;
     void calcEnergyValues(bool bDayOld);
     void calcCopDay();
     //virtual void logPrint(const char* logstring) {debug_print(logstring)}

  public:
    LuxWebsocket();
    ~LuxWebsocket ();
    static WS_POLL_STATUS poll_state;

    bool init(const char* url, const char* password);
    void poll();
    void setpolling(bool on_off);
    bool isConnected() {
                         if (poll_state >= WS_POLL_STATUS::SEND_GET_INFO)
                         {return true;}
                         return false;
                       }
    const char* getCSVfetch(bool all=false);
    const char* getval(LUX_VAL_TYPE valtype);
    float getvalf(LUX_VAL_TYPE valtype);
    uint  getvalui(LUX_VAL_TYPE valtype);
    void loop() { _wsClient.loop();}
  
};

#endif